app/Controllers/Admin.php

    public function getSchedules()
    {
        $auth = $this->checkAdminAuth();
        if ($auth !== true) {
            return $this->response->setJSON(['schedules' => []]);
        }

        $course_id = $this->request->getGet('course_id');
        if (!$course_id) {
            return $this->response->setJSON(['schedules' => []]);
        }

        $schedules = $this->scheduleModel->getSchedulesByCourse($course_id);
        $course = $this->courseModel->find($course_id);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '4'

    public function assignTeacher()
    {
        $auth = $this->checkAdminAuth();
        if ($auth !== true) return $auth;

        if ($this->request->getMethod() === 'POST') {
            $course_id = $this->request->getPost('course_id');
            $teacher_id = $this->request->getPost('teacher_id');
            $schedulesJson = $this->request->getPost('schedules');

            if (!$course_id) {
                session()->setFlashdata('error', 'Course ID is required.');
                return redirect()->to(base_url('dashboard'));
            }

            // Validate course exists
            $course = $this->courseModel->find($course_id);
            if (!$course) {
                session()->setFlashdata('error', 'Course not found.');
                return redirect()->to(base_url('dashboard'));
            }

            // If teacher_id is provided, validate teacher exists and is a teacher
            if ($teacher_id) {
                $teacher = $this->userModel->find($teacher_id);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '4'
SELECT *
FROM `users`
WHERE `users`.`id` = '4'

                    $updateData['max_students'] = null;
                }

                $this->courseModel->update($course_id, $updateData);
---
UPDATE `courses` SET `instructor_id` = '4', `semester` = '1st Semester', `academic_year` = '2025-2026', `max_students` = 50, `updated_at` = '2025-12-12 05:13:41'
WHERE `courses`.`id` IN ('4')

    public function getTeacherStudents($teacher_id)
    {
        $auth = $this->checkAdminAuth();
        if ($auth !== true) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Access denied.'
            ])->setStatusCode(403);
        }

        // Get all courses taught by this teacher
        $courses = $this->courseModel->where('instructor_id', $teacher_id)->findAll();
        $courseIds = array_column($courses, 'id');

        if (empty($courseIds)) {
            return $this->response->setJSON([
                'success' => true,
                'students' => []
            ]);
        }

        // Get all enrollments for these courses
        $enrollmentModel = new \App\Models\EnrollmentModel();
        $enrollments = $enrollmentModel->select('enrollments.*, users.name as student_name, users.email as student_email, courses.title as course_title')
                                      ->join('users', 'users.id = enrollments.user_id')
                                      ->join('courses', 'courses.id = enrollments.course_id')
                                      ->whereIn('enrollments.course_id', $courseIds)
                                      ->where('enrollments.status', 'active')
                                      ->orderBy('users.name', 'ASC')
                                      ->findAll();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '4'
SELECT `enrollments`.*, `users`.`name` as `student_name`, `users`.`email` as `student_email`, `courses`.`title` as `course_title`
FROM `enrollments`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`course_id` IN ('2','3','4')
AND `enrollments`.`status` = 'active'
ORDER BY `users`.`name` ASC