app/Controllers/Assignment.php

    public function view($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $assignment = $this->assignmentModel->find($id);
        if (!$assignment) {
            session()->setFlashdata('error', 'Assignment not found.');
            return redirect()->to(base_url('assignment'));
        }

        $role = session()->get('role');
        $user_id = session()->get('user_id');

        if ($role === 'teacher') {
            // Check if teacher owns this assignment
            if ($assignment['teacher_id'] != $user_id) {
                session()->setFlashdata('error', 'Access denied.');
                return redirect()->to(base_url('assignment'));
            }

            $submissions = $this->submissionModel->getSubmissionsByAssignment($id);
            $course = $this->courseModel->find($assignment['course_id']);
---
SELECT *
FROM `assignments`
WHERE `assignments`.`id` = '2'
SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'

            }

            $submission = $this->submissionModel->getSubmission($id, $user_id);
            $course = $this->courseModel->find($assignment['course_id']);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'