app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'student@gmail.com'
 LIMIT 1
---
    public function login()
    {
        // Redirect if already logged in
        if (session()->get('isLoggedIn')) {
                    return redirect()->to('/dashboard');
        }

        helper(['form']);
        $session = session();
        $model = new UserModel();
        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required'
            ];
            if ($this->validate($rules)) {
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');
                $user = $model->where('email', $email)->first();