app/Controllers/Student.php

    public function dashboard()
    {
        // Must be logged in
        if (!session()->get('isLoggedIn')) {
            session()->setFlashdata('error', 'Please login first.');
            return redirect()->to(base_url('login'));
        }

        $user_id = session()->get('user_id');

        // Get user's enrollments
        $enrollments = $this->enrollmentModel->getUserEnrollments($user_id);

        // Get available courses (courses not enrolled in)
        $enrolled_course_ids = array_column($enrollments, 'course_id');
        $all_courses = [];

        if (!empty($enrolled_course_ids)) {
            $all_courses = $this->courseModel->whereNotIn('id', $enrolled_course_ids)->findAll();
---
SELECT *
FROM `courses`