app/Models/AssignmentModel.php

SELECT `assignments`.*, `courses`.`title` as `course_title`
FROM `assignments`
JOIN `courses` ON `courses`.`id` = `assignments`.`course_id`
WHERE `assignments`.`teacher_id` = '2'
ORDER BY `assignments`.`created_at` DESC
---
    public function getAssignmentsByTeacher($teacher_id)
    {
        return $this->select('assignments.*, courses.title as course_title')
                    ->join('courses', 'courses.id = assignments.course_id')
                    ->where('assignments.teacher_id', $teacher_id)
                    ->orderBy('assignments.created_at', 'DESC')
                    ->findAll();