app/Models/AssignmentSubmissionModel.php

SELECT *
FROM `assignment_submissions`
WHERE `assignment_id` = '2'
AND `student_id` = '3'
 LIMIT 1
---
    public function getSubmission($assignment_id, $student_id)
    {
        $result = $this->where('assignment_id', $assignment_id)
                    ->where('student_id', $student_id)
                    ->first();

SELECT `assignment_submissions`.*, `users`.`name` as `student_name`, `users`.`email` as `student_email`
FROM `assignment_submissions`
JOIN `users` ON `users`.`id` = `assignment_submissions`.`student_id`
WHERE `assignment_submissions`.`assignment_id` = '2'
ORDER BY `assignment_submissions`.`submitted_at` DESC
---
    public function getSubmissionsByAssignment($assignment_id)
    {
        return $this->select('assignment_submissions.*, users.name as student_name, users.email as student_email')
                    ->join('users', 'users.id = assignment_submissions.student_id')
                    ->where('assignment_submissions.assignment_id', $assignment_id)
                    ->orderBy('assignment_submissions.submitted_at', 'DESC')
                    ->findAll();