app/Models/AssignmentAnswerModel.php

    public function getAnswersBySubmission($submission_id)
    {
        return $this->select('assignment_answers.*, assignment_questions.question_text, assignment_questions.correct_answer, assignment_questions.points')
                    ->join('assignment_questions', 'assignment_questions.id = assignment_answers.question_id')
                    ->where('assignment_answers.submission_id', $submission_id)
                    ->orderBy('assignment_questions.order', 'ASC')
                    ->findAll();
---
SELECT `assignment_answers`.*, `assignment_questions`.`question_text`, `assignment_questions`.`correct_answer`, `assignment_questions`.`points`
FROM `assignment_answers`
JOIN `assignment_questions` ON `assignment_questions`.`id` = `assignment_answers`.`question_id`
WHERE `assignment_answers`.`submission_id` = '1'
ORDER BY `assignment_questions`.`order` ASC