app/Models/AssignmentQuestionModel.php

SELECT *
FROM `assignment_questions`
WHERE `assignment_id` = '2'
ORDER BY `order` ASC, `id` ASC
---
    public function getQuestionsByAssignment($assignment_id)
    {
        return $this->where('assignment_id', $assignment_id)
                    ->orderBy('order', 'ASC')
                    ->orderBy('id', 'ASC')
                    ->findAll();