app/Models/CourseModel.php

    public function getCoursesByInstructor($instructor_id)
    {
        return $this->where('instructor_id', $instructor_id)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '2'
ORDER BY `created_at` DESC