app/Models/CourseScheduleModel.php

    public function getSchedulesByCourse($course_id)
    {
        return $this->where('course_id', $course_id)
                    ->orderBy('day_of_week', 'ASC')
                    ->orderBy('start_time', 'ASC')
                    ->findAll();
---
SELECT *
FROM `course_schedules`
WHERE `course_id` = '4'
ORDER BY `day_of_week` ASC, `start_time` ASC

    public function deleteByCourse($course_id)
    {
        return $this->where('course_id', $course_id)->delete();
---
DELETE FROM `course_schedules`
WHERE `course_id` = '4'

    public function getSchedulesByTeacherAndDay($teacher_id, $day_of_week, $exclude_course_id = null)
    {
        $builder = $this->db->table('course_schedules');
        $builder->select('course_schedules.*, courses.title as course_title');
        $builder->join('courses', 'courses.id = course_schedules.course_id');
        $builder->where('courses.instructor_id', $teacher_id);
        $builder->where('course_schedules.day_of_week', $day_of_week);

        if ($exclude_course_id) {
            $builder->where('course_schedules.course_id !=', $exclude_course_id);
        }

        return $builder->get()->getResultArray();
---
SELECT `course_schedules`.*, `courses`.`title` as `course_title`
FROM `course_schedules`
JOIN `courses` ON `courses`.`id` = `course_schedules`.`course_id`
WHERE `courses`.`instructor_id` = '4'
AND `course_schedules`.`day_of_week` = 'Monday'
AND `course_schedules`.`course_id` != '4'