app/Models/EnrollmentModel.php

    public function getUserEnrollments($user_id)
    {
        // First, remove expired enrollments for this user
        $this->removeExpiredEnrollments($user_id);

        return $this->select('enrollments.*, courses.title as course_title, courses.description as course_description, courses.instructor_id')
                    ->join('courses', 'courses.id = enrollments.course_id', 'left')
                    ->where('enrollments.user_id', $user_id)
                    ->where('enrollments.status', 'active')
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();
---
SELECT `enrollments`.*, `courses`.`title` as `course_title`, `courses`.`description` as `course_description`, `courses`.`instructor_id`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '3'
AND `enrollments`.`status` = 'active'
ORDER BY `enrollments`.`enrollment_date` DESC

    public function removeExpiredEnrollments($user_id = null)
    {
        $builder = $this->where('status', 'active');

        if ($user_id) {
            $builder->where('user_id', $user_id);
        }

        $enrollments = $builder->findAll();
        $removedCount = 0;

        foreach ($enrollments as $enrollment) {
            if ($this->isEnrollmentExpired($enrollment['enrollment_date'])) {
                // Delete the enrollment
                $this->delete($enrollment['id']);
---
SELECT *
FROM `enrollments`
WHERE `status` = 'active'
AND `user_id` = '3'
DELETE FROM `enrollments`
WHERE `id` IN ('1')

    public function isAlreadyEnrolled($user_id, $course_id)
    {
        $enrollment = $this->where('user_id', $user_id)
                          ->where('course_id', $course_id)
                          ->first();
---
SELECT *
FROM `enrollments`
WHERE `user_id` = '3'
AND `course_id` = '2'
 LIMIT 1