app/Models/NotificationModel.php

    public function getNotificationsForUser($userId)
    {
        return $this->where('user_id', $userId)
                   ->orderBy('created_at', 'DESC')
                   ->limit(5)
                   ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '5'
ORDER BY `created_at` DESC
 LIMIT 5